# 第7章 数据清洗与准备

In [2]:
import numpy as np
import pandas as pd
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [3]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [5]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleanes = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [7]:
cleanes

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(axis=1,how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [11]:
data.dropna(axis=0,how='any')

     0    1    2
0  1.0  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.943396  1.076932 -1.843457
1  0.697618  0.615058 -1.140598
2 -1.381419  0.387352  1.060089
3 -0.111095 -0.316664 -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [13]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.943396       NaN       NaN
1  0.697618       NaN       NaN
2 -1.381419       NaN  1.060089
3 -0.111095       NaN -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [15]:
df.dropna()

          0         1         2
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [16]:
df

          0         1         2
0 -0.943396       NaN       NaN
1  0.697618       NaN       NaN
2 -1.381419       NaN  1.060089
3 -0.111095       NaN -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [17]:
df.dropna(thresh=3)

          0         1         2
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [19]:
df.dropna(thresh=2)

          0         1         2
2 -1.381419       NaN  1.060089
3 -0.111095       NaN -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [22]:
df.fillna(value=0)

          0         1         2
0 -0.943396  0.000000  0.000000
1  0.697618  0.000000  0.000000
2 -1.381419  0.000000  1.060089
3 -0.111095  0.000000 -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [23]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.943396  0.500000  0.000000
1  0.697618  0.500000  0.000000
2 -1.381419  0.500000  1.060089
3 -0.111095  0.500000 -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [24]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -0.943396  0.000000  0.000000
1  0.697618  0.000000  0.000000
2 -1.381419  0.000000  1.060089
3 -0.111095  0.000000 -1.885055
4  0.630313 -1.219487  0.233243
5  0.079836 -1.388281 -1.925692
6 -1.564968  0.242843  0.024546

In [25]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  1.481885  0.214117  1.461513
1  0.091129  1.578216  1.035961
2  0.228623       NaN -0.551833
3  0.016824       NaN -1.310414
4 -2.392819       NaN       NaN
5  1.766291       NaN       NaN

In [26]:
df[2][1]

1.0359608473840514

In [28]:
df

          0         1         2
0  1.481885  0.214117  1.461513
1  0.091129  1.578216  1.035961
2  0.228623       NaN -0.551833
3  0.016824       NaN -1.310414
4 -2.392819       NaN       NaN
5  1.766291       NaN       NaN

In [29]:
df[2]

0    1.461513
1    1.035961
2   -0.551833
3   -1.310414
4         NaN
5         NaN
Name: 2, dtype: float64

In [36]:
df.iloc[3,0]

0.016824306841925527

In [37]:
df.fillna(method='ffill')

          0         1         2
0  1.481885  0.214117  1.461513
1  0.091129  1.578216  1.035961
2  0.228623  1.578216 -0.551833
3  0.016824  1.578216 -1.310414
4 -2.392819  1.578216 -1.310414
5  1.766291  1.578216 -1.310414

In [38]:
data = pd.DataFrame({'k1':['one','two']*3 + ['two'],
                    'k2':[1,1,2,3,4,5,6]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   5
6  two   6

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   5
6  two   6

In [41]:
data['v1'] = range(7)

In [42]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
5  two   5   5
6  two   6   6

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data = pd.read_csv('Desktop/1.csv')
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honet ham     5.0
8     nova lox     6.0

In [63]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honet ham':'pig',
    'nova lox':'salmon'
}

In [64]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honet ham
8       nova lox
Name: food, dtype: object

In [65]:
data['food'].str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honet ham
8       nova lox
Name: food, dtype: object

In [66]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honet ham     5.0     pig
8     nova lox     6.0  salmon

In [67]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [68]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [70]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [74]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [75]:
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [76]:
data.index = data.index.map(transform)

In [77]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [78]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [79]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [2]:
ages=[20,	22,	25,	27,	21,	23,	37,	31,	61,	45,	41,	32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [5]:
import numpy as np
import pandas as pd
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.009956     0.026986     0.009777     0.030403
std       0.984190     0.995015     0.992629     0.990648
min      -2.982652    -3.401998    -3.188745    -3.643605
25%      -0.676097    -0.604734    -0.658947    -0.648661
50%      -0.041867     0.036487     0.005102     0.036665
75%       0.588338     0.672071     0.706907     0.672629
max       2.823232     3.160523     3.138872     3.039646

In [6]:
col = data[2]

In [8]:
col[np.abs(col) > 3]

114    3.138872
891   -3.188745
Name: 2, dtype: float64

In [31]:
data[(np.abs(data) > 3).any(1)]

array([[ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

AttributeError: 'numpy.ndarray' object has no attribute 'describe'

In [35]:
val = 'a,b,guido'
val.split(',')

['a', 'b', 'guido']

In [36]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [37]:
pieces

['a', 'b', 'guido']

In [38]:
'::'.join(pieces)

'a::b::guido'

In [41]:
a = ['c','d','e']
'a'.join(a)

'cadae'

In [42]:
''.join(a)

'cde'

In [43]:
val

'a,b,guido'

In [44]:
val.index(',')

1

In [45]:
val.find(':')

-1

In [49]:
import re
text = 'foo    bar\t baz  \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [51]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [53]:
regex.findall(text)

['    ', '\t ', '  \t']